// SPDX-FileCopyrightText: 2022 Félix Robles <felix@sequentech.io>
//
// SPDX-License-Identifier: AGPL-3.0-only
const hebrewTranslation = {
    translations: {
        common: {
            goBack: "חזור",
        },
        breadcrumbSteps: {
            electionList: "רשימת הבחירות",
            ballot: "קלף הצבעה",
            review: "סקירה",
            confirmation: "אישור",
            audit: "אודיט",
        },
        votingScreen: {
            backButton: "חזור",
            reviewButton: "הבא",
            ballotHelpDialog: {
                title: "מידע: מסך קלף",
                content:
                    "מסך זה מציג את התחרות שבה אתה זכאי להצביע. ניתן לבחור את הבחירה שלך על ידי הפעלת התיק בצד ימין. כדי לאפס את הבחירות שלך, לחץ על לחצן “<b>אפס בחירה</b>”, וכדי להמשיך לשלב הבא, לחץ על לחצן “<b>הבא</b>” למטה.",
                ok: "אוקי",
            },
        },
        startScreen: {
            startButton: "התחל להצביע",
            instructionsTitle: "הוראות",
            instructionsDescription: "עליך לעקוב אחרי השלבים הללו כדי להציב את הקלף שלך:",
            step1Title: "1. בחר את האפשרויות שלך",
            step1Description: "ענה על שאלות הבחירות לפי הצגתן. בכך תקבע את ההעדפות שלך בקלף.",
            step2Title: "2. סקור את הקלף שלך",
            step2Description:
                "לאחר שבחרת בהעדפות שלך, נמשיך להצפנתן ותוצג במסך כתובת מסלול הקלף שלך. תוצג גם תקציר של תוכן הקלף לצורך סקירה.",
            step3Title: "3. הצב את הקלף שלך",
            step3Description:
                "ניתן להציב את הקלף כך שירשם בצורה תקינה. בנוסף, ניתן לבדוק באמצעות אודיט שהקלף הוצפן בצורה תקינה.",
        },
        reviewScreen: {
            title: "סקור את הקלף שלך",
            description:
                "כדי לבצע שינויים בבחירות שלך, לחץ על לחצן “<b>שנה בחירה</b>”, לאשר את הבחירות שלך, לחץ על לחצן “<b>שלח את הקלף</b>” למטה, ולביצוע אודיט של הקלף לחץ על לחצן “<b>אודיט את הקלף</b>” למטה. שים לב שאחרי שתשלח את הקלף שלך, תהיה לך הצבעה ולא יינתן לך קלף נוסף לבחירות בבחירות הנוכחיות.",
            backButton: "ערוך קלף",
            castBallotButton: "שלח את הקלף",
            auditButton: "אודיט את הקלף",
            reviewScreenHelpDialog: {
                title: "מידע: מסך סקירה",
                content: "מסך זה מאפשר לך לסקור את הבחירות שלך לפני שתשלח את הקלף.",
                ok: "אוקי",
            },
            ballotIdHelpDialog: {
                title: "ההצבעה לא בוצעה עדיין",
                content:
                    "<p>זהו מספר המזהה שלך, אך <b>ההצבעה שלך לא בוצעה עדיין</b>. אם תנסה לבדוק את הקלף, לא תמצא אותו.</p><p>הסיבה שאנו מציגים את מזהה המזהה במסך זה היא לאפשר לך לבדוק את נכונות ההצבעה שלך לפני שתשלח אותה.</p>",
                ok: "אני מאשר שההצבעה שלי לא בוצעה עדיין",
                cancel: "ביטול",
            },
            auditBallotHelpDialog: {
                title: "האם ברצונך לאודיט את הקלף?",
                content:
                    "<p>אודיט את הקלף יפגע בו וידרוש לך להתחיל מחדש את תהליך ההצבעה אם תרצה לשלוח את ההצבעה שלך. תהליך האודיט מאפשר לך לוודא שהקלף נצבע בצורה נכונה. התהליך דורש מכם ידע טכני חשוב, ולכן אנו לא ממליצים עליו אם אתה לא יודע מה אתה עושה.</p><p><b>אם אתה רוצה פשוט לשלוח את הקלף שלך, לחץ <u>ביטול</u> כדי לחזור למסך סקירת הקלף.</b></p>",
                ok: "כן, ברצוני לבטל את הקלף שלי לצורך אודיט",
                cancel: "ביטול",
            },
        },
        confirmationScreen: {
            title: "הצבעתך הושלמה",
            description:
                "הקוד אישור למטה מאשר ש <b>הקלף שלך הושלם בהצלחה</b>. תוכל להשתמש בקוד זה לאמת שהקלף שלך נספר.",
            ballotId: "מזהה הקלף",
            printButton: "הדפס",
            finishButton: "סיום",
            verifyCastTitle: "אמת שהקלף שלך הושלם",
            verifyCastDescription: "תוכל לאמת שהקלף שלך הושלם נכונה בכל רגע באמצעות קוד QR הבא:",
            confirmationHelpDialog: {
                title: "מידע: מסך אישור",
                content:
                    "מסך זה מראה שההצבעה שלך הושלמה בהצלחה. המידע המוצג בדף זה מאפשר לך לאמת שהקלף נשמר בתיק הקלפים, ניתן לבצע את האמיתות הללו בכל רגע בזמן במהלך ההצבעות ואף לאחר סיום הבחירות.",
                ok: "אוקי",
            },
            ballotIdHelpDialog: {
                title: "מידע: מזהה הקלף",
                content:
                    "מזהה הקלף הוא קוד שמאפשר לך למצוא את הקלף שלך בתיק הקלפים, המזהה ייחודי ואינו מכיל מידע על בחירותיך.",
                ok: "אוקי",
            },
        },
        auditScreen: {
            printButton: "הדפסה",
            restartButton: "התחל בהצבעה",
            title: "אודיט קלף ההצבעה שלך",
            description: "כדי לאמת את קלף ההצבעה שלך, יש לעקוב אחר השלבים הבאים:",
            step1Title: "1. הורד או העתק את המידע הבא",
            step1Description:
                "את <b>מספר זיהוי הקלף</b> שמופיע למעלה מהמסך ואת הקלף המוצפן שלך למטה:",
            step1HelpDialog: {
                title: "העתק את קלף ההצבעה המוצפן",
                content:
                    "ניתן להוריד או להעתיק את קלף ההצבעה המוצפן שלך כדי לבצע אודיט ולוודא שהתוכן המוצפן מכיל את הבחירות שלך.",
                ok: "אישור",
            },
            downloadButton: "הורדה",
            step2Title: "2. אמת את קלף ההצבעה שלך",
            step2Description:
                '<a class="link" href="{{linkToBallotVerifier}}" target="_blank">גישה למאמת הקלף המוצפן</a>, טאב חדש ייפתח בדפדפן שלך.',
            step2HelpDialog: {
                title: "מדריך לאודיט קלף ההצבעה",
                content:
                    "כדי לאמת את קלף ההצבעה שלך, עליך לעקוב אחר השלבים המוצגים במדריך. זה כולל הורדת יישום לשולחן העבודה המשמש לאימות הקלף המוצפן באופן עצמא מהאתר.",
                ok: "אישור",
            },
            bottomWarning:
                "מסיבות אבטחה, כאשר אתה עושה אודיט לקלף ההצבעה שלך, הוא ייפגע. כדי להמשיך עם תהליך ההצבעה, עליך ללחוץ על '<b>התחל בהצבעה</b>' למטה.",
        },
        electionSelectionScreen: {
            title: "רשימת הבחירות",
            description: "בחר את הבחירה שבה תרצה להצביע",
            chooserHelpDialog: {
                title: "מידע: רשימת הבחירות",
                content:
                    'ברוך הבא לתיק קלפים, מסך זה מציג את רשימת הבחירות שבהן ניתן להצביע. הבחירות המוצגות ברשימה יכולות להיות פתוחות להצבעה, מתוזמנות או סגורות. תוכל לגשת לקלף רק אם חל פרק הצבעה. במקרה שהבחירה נסגרה והמנהל שלך פרסם את התוצאות, תראה כפתור "תוצאות הבחירות" שיביא אותך לדף התוצאות הציבורי.',
                ok: "אישור",
            },
            noResults: "אין בחירות לעכשיו.",
        },
        errors: {
            encoding: {
                notEnoughChoices: "אין מספיק בחירות לפענוח",
                writeInChoiceOutOfRange: "בחירת כתיבה מחוץ לטווח: {{index}}",
                writeInNotEndInZero: "בחירת כתיבה אינה מסתיימת ב־0",
                writeInCharsExceeded:
                    "בחירת כתיבה חורגת ב-{{numCharsExceeded}} מכמות התווים המרבית. נדרש תיקון.",
                bytesToUtf8Conversion:
                    "שגיאה בהמרת בחירת כתיבה מבתים למחרוזת UTF-8: {{errorMessage}}",
                ballotTooLarge: "הקלף גדול מהמצופה",
            },
            implicit: {
                selectedMax: "מספר הבחירות הנבחרות {{numSelected}} גדול מהמקסימום {{max}}",
                selectedMin: "מספר הבחירות הנבחרות {{numSelected}} קטן מהמינימום {{min}}",
            },
            explicit: {
                notAllowed: "הקלף סומן כלא תקף באופן מפורש אך השאלה אינה מאפשרת זאת",
            },
            page: {
                oopsWithStatus: "אופס! {{status}}",
                oopsWithoutStatus: "אופס! שגיאה לא צפויה",
                somethingWrong: "משהו השתבש.",
            },
        },
        materials: {
            common: {
                label: "חומרי תמיכה",
                back: "חזור לרשימת הבחירות",
                close: "סגור",
                preview: "תצוגה מקדימה",
            },
        },
        ballotLocator: {
            title: "איתור קלף ההצבעה שלך",
            titleResult: "תוצאת חיפוש קלף ההצבעה שלך",
            description: "אמת שקלף ההצבעה שלך הופקד בצורה נכונה",
            locate: "אתר את קלף ההצבעה שלך",
            locateAgain: "אתר קלף ההצבעה נוסף",
            found: "מספר זיהוי הקלף שלך {{ballotId}} נמצא",
            notFound: "מספר זיהוי הקלף שלך {{ballotId}} לא נמצא",
            contentDesc: "זהו תוכן הקלף שלך: ",
            wrongFormatBallotId: "פורמט שגוי עבור מספר זיהוי הקלף",
            steps: {
                lookup: "אתר את קלף ההצבעה שלך",
                result: "תוצאה",
            },
            titleHelpDialog: {
                title: "מידע: מסך איתור קלף ההצבעה",
                content:
                    "מסך זה מאפשר לבוחר לאתר את ההצבעה שלו באמצעות מספר זיהוי הקלף ולאמת שההצבעה נרשמה בצורה נכונה ושההצבעה המוקלטת תואמת לקלף ההצבעה המוצפן שנשלח.",
                ok: "אישור",
            },
        },
    },
}

export type TranslationType = typeof hebrewTranslation

export default hebrewTranslation
